backend/app/controllers/api/albums_controller.rb

    def index
        @albums = Api::Album.all
---
SELECT "api_albums".* FROM "api_albums"

    def show
      @album = Api::Album.find_by(id: params[:id])
---
SELECT "api_albums".* FROM "api_albums" WHERE "api_albums"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def get_ablbums_for_user
        user = Api::User.find_by(id: params[:id])
---
SELECT "api_users".* FROM "api_users" WHERE "api_users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]