backend/app/controllers/api/albums_controller.rb

SELECT "api_users".* FROM "api_users" WHERE "api_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def get_ablbums_for_user
        user = Api::User.find_by(id: params[:id])