backend/app/controllers/api/photos_controller.rb

     def index
        @photos = Api::Photo.all
---
SELECT "api_photos".* FROM "api_photos"

    def show
        @photo = Api::Photo.find_by(id: params[:id])
---
SELECT "api_photos".* FROM "api_photos" WHERE "api_photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def update
        @photo = Api::Photo.find_by(id: params[:id])

        if @photo
        if @photo.update(photo_params)
---
SELECT "api_photos".* FROM "api_photos" WHERE "api_photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "api_photos" SET "photo_title" = ?, "updated_at" = ? WHERE "api_photos"."id" = ?  [["photo_title", "Cindy's Photo-2"], ["updated_at", "2024-06-04 07:25:22.492351"], ["id", 1]]