backend/app/controllers/api/sessions_controller.rb

SELECT "api_users".* FROM "api_users" WHERE "api_users"."email" = ? LIMIT ?  [["email", "crmisoi2k@gmail.com"], ["LIMIT", 1]]
---
  def create
    email = params[:email]
    user = Api::User.find_by(email: email)