backend/app/controllers/api/users_controller.rb

    def show
      user = Api::User.find_by(id: params[:id])
---
SELECT "api_users".* FROM "api_users" WHERE "api_users"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

    def destroy
        user = Api::User.find(params[:id])

        if user.nil?
        render json: { error: 'User not found' }, status: :not_found
        return
        end

        # Find and destroy associated albums and photos
        user.api_albums.each do |album|
        album.api_photos.destroy_all # Destroy associated photos
        album.destroy # Destroy the album
        end

        # Then, delete the user
        user.destroy
---
SELECT "api_albums".* FROM "api_albums" WHERE "api_albums"."api_user_id" = ?  [["api_user_id", 2]]
DELETE FROM "api_photos" WHERE "api_photos"."id" = ?  [["id", 1]]
DELETE FROM "api_users" WHERE "api_users"."id" = ?  [["id", 2]]