backend/app/controllers/api/users_controller.rb

    def google
      token = params[:token]

      begin
        # Verify JWT token
        payload = Google::Auth::IDTokens.verify_oidc(token, aud: ENV['GOOGLE_CLIENT_ID'])

        # Check audience claim
        if payload['aud'] != ENV['GOOGLE_CLIENT_ID']
          render json: { error: 'Invalid audience' }, status: :unauthorized
          return
        end

        # Check issuer claim
        if payload['iss'] != 'https://accounts.google.com'
          render json: { error: 'Invalid issuer' }, status: :unauthorized
          return
        end

        # Extract user data from token
        email = payload['email']
        name = payload['name']
        username = payload['given_name']

        # Find or create the user
        user = Api::User.find_or_initialize_by(email: email)
        user.name = name
        user.username = username

        if user.save
---
SELECT "api_users".* FROM "api_users" WHERE "api_users"."email" = ? LIMIT ?  [["email", "crmisoi2k@gmail.com"], ["LIMIT", 1]]
UPDATE "api_users" SET "name" = ?, "username" = ?, "updated_at" = ? WHERE "api_users"."id" = ?  [["name", "Cynthia Misoi"], ["username", "Cynthia"], ["updated_at", "2024-06-03 16:49:13.256292"], ["id", 3]]

    def index
      @users = Api::User.all
---
SELECT "api_users".* FROM "api_users"

    def destroy
        user = Api::User.find(params[:id])

        if user.nil?
        render json: { error: 'User not found' }, status: :not_found
        return
        end

        # Find and destroy associated albums and photos
        user.api_albums.each do |album|
        album.api_photos.destroy_all # Destroy associated photos
        album.destroy # Destroy the album
        end

        # Then, delete the user
        user.destroy
---
SELECT "api_users".* FROM "api_users" WHERE "api_users"."api_user_id" = ? LIMIT ?  [["api_user_id", "1"], ["LIMIT", 1]]
SELECT "api_users".* FROM "api_users" WHERE "api_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "api_albums".* FROM "api_albums" WHERE "api_albums"."api_user_id" = ?  [["api_user_id", 1]]
DELETE FROM "api_albums" WHERE "api_albums"."id" = ?  [["id", 1]]
DELETE FROM "api_photos" WHERE "api_photos"."id" = ?  [["id", 1]]
DELETE FROM "api_users" WHERE "api_users"."id" = ?  [["id", 1]]